#include <stdio.h>
int main() {
    int a, b, c;
    printf("Задайте першу сторону трикутника: ");
    scanf("%d", &a);
    printf("Задайте другу сторону трикутника: ");
    scanf("%d", &b);
    printf("Задайте третю сторону трикутника: ");
    scanf("%d", &c);
    if (a == b && b == c) {
        printf("Рівносторонній (правильний) трикутник");
    } else if (a == b || a == c || b == c) {
        printf("Рівнобедрений трикутник");
    } else {
        printf("Різносторонній трикутник");
    }
    return 0;
}

