#include <stdio.h> //введення бібліотек
#include <math.h>
 int main() {
    int r, h; //введення змінних
    float S, V;
    printf("Задайте радіус основи циліндра r="); //рядок для введення цілого числа r
    scanf("%d",&r); //cканування цілого числа
    printf("Задайте висоту циліндра h="); //рядок для введення цілого числа h
    scanf("%d",&h); //cканування цілого числа
    V=M_PI*pow(r,2)*h; //формула об'єму
    S=2*M_PI*r*h; //формула площі повної поверхні
    printf("Площа бічної поверхні циліндра=%.2lf \n", S); //виведення чисел з функцій
    printf("Об'єм циліндра=%.2lf \n", V);
   return 0;
     }